cases/artigo_mestrado/on-caso-1.2/_mesh_indep_fluid/f3/0/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

dimensions      [ 0 1 -1 0 0 0 0 ];
internalField   uniform ( 0 0 0 );
boundaryField
{
    // Escoamento dirigido por pressao (p fixo nas duas extremidades): U
    // extrapolado (zeroGradient) e' mais estavel que pressureInletOutletVelocity,
    // que oscila na malha fina (BC alterna inlet/outlet com fluxo quase nulo).
    inlet           { type zeroGradient; }
    outlet_peri     { type zeroGradient; }
    fsi_pia         { type noSlip; }
    fsi_dura        { type noSlip; }
    lid_wall_inner  { type noSlip; }
    lid_wall_outer  { type noSlip; }
}
