cases/artigo_mestrado/on-caso-1.2/_mesh_indep_fluid/f3/constant/transportProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object transportProperties;
}

nu              nu  [0 2 -1 0 0 0 0] 1.0e-6;
transportModel  Newtonian;
