cases/artigo_mestrado/on-caso-1.2/_mesh_indep_fluid/f3/constant/turbulenceProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object turbulenceProperties;
}
simulationType laminar;
