cases/artigo_mestrado/on-caso-1.2/_mesh_indep_fluid/f3/system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution;
}

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-09;
        relTol          0.01;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 20;
    }
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-09;
        relTol          0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    consistent      no;
    residualControl
    {
        p   1e-6;
        U   1e-7;
    }
}

// SIMPLE classico com sub-relaxacao forte: converge de forma MONOTONA e evita
// o ciclo-limite que o SIMPLEC (consistent yes) sofre na malha fina (f3).
relaxationFactors
{
    fields
    {
        p   0.3;
    }
    equations
    {
        U   0.7;
    }
}
